tap "manaflow-ai/cmux"
brew "awscli"
brew "bat"
brew "crane"
brew "direnv"
brew "fd"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "gnupg"
brew "helm"
brew "jq"
brew "k3d"
brew "kind"
brew "kubernetes-cli"
brew "okta-aws-cli"
if OS.mac?
	brew "pinentry-mac"
end
brew "podman"
brew "pre-commit"
brew "ripgrep"
brew "sesh"
brew "shellcheck"
brew "shfmt"
brew "stow"
brew "tailscale"
brew "tmux"
brew "tree"
brew "uv"
brew "ykman"
brew "zoxide"
brew "zsh-autosuggestions"
cask "alt-tab"
cask "claude-code"
cask "cmux"
cask "font-jetbrains-mono-nerd-font"
cask "keybase"
vscode "anthropic.claude-code"
vscode "artdiniz.quitcontrol-vscode"
vscode "bierner.markdown-mermaid"
vscode "github.codespaces"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "redhat.vscode-yaml"
vscode "yzhang.markdown-all-in-one"
