tap "wpscanteam/tap"
brew "ca-certificates"
brew "python@3.12"
brew "azure-cli"
brew "bash"
brew "check"
brew "cmatrix"
brew "gmp"
brew "coreutils"
brew "cowsay"
brew "fortune"
brew "fzf"
brew "gettext"
brew "gh"
brew "gnu-sed"
brew "libevent"
brew "gnupg"
brew "helm"
brew "hexedit"
brew "htop"
brew "inetutils"
brew "jq"
brew "kepubify"
brew "minikube"
brew "mysql"
brew "netcat"
brew "nmap"
brew "ollama"
brew "openvpn"
brew "parallel"
brew "python-tk@3.12"
brew "python@3.10"
brew "python@3.11"
brew "shellcheck"
brew "stow"
brew "testdisk"
brew "tlrc"
brew "utf8proc"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "yamllint"
brew "zoxide"
brew "zsh-autosuggestions"
brew "vfkit"
cask "brave-browser"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "miniconda"
cask "orbstack"
cask "yt-music"
cask "zoom"
vscode "artdiniz.quitcontrol-vscode"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "yzhang.markdown-all-in-one"
