abseil
aircrack-ng
allegro
argtable
azure-cli
bash
binwalk
ca-certificates
check
cmatrix
coreutils
cowsay
dumb
enum4linux
exiftool
flac
fortune
freetype
fzf
gdbm
gettext
gh
giflib
gmp
gnu-sed
gnupg
gnutls
go
gobuster
hashcat
helm
hexedit
htop
hydra
icu4c@76
inetutils
john-jumbo
jpeg-turbo
jq
kepubify
krb5
kubernetes-cli
lame
libassuan
libevent
libgcrypt
libgpg-error
libidn2
libksba
liblinear
libnghttp2
libogg
libopenmpt
libpng
libsndfile
libsodium
libssh
libssh2
libtasn1
libtiff
libtommath
libunistring
libusb
libvorbis
libxcrypt
libyaml
lmdb
lua
lz4
lzo
mariadb-connector-c
minikube
minizip
mpdecimal
mpg123
mysql
ncurses
netcat
nettle
nmap
npth
ollama
oniguruma
openssl@3
openvpn
opus
opusfile
p11-kit
p7zip
parallel
pcre
pcre2
physfs
pinentry
pkcs11-helper
popt
portaudio
protobuf
python-tk@3.12
python@3.10
python@3.11
python@3.12
python@3.13
readline
rlwrap
samba
sdl2
shellcheck
sqlite
sqlmap
talloc
tcl-tk
tdb
testdisk
tevent
theora
tmux
tree
unbound
utf8proc
vfkit
watch
webp
wget
xxhash
xz
yamllint
zlib
zsh-autosuggestions
zstd
brave-browser
microsoft-auto-update
microsoft-outlook
miniconda
orbstack
yt-music
zoom
