tap "anomalyco/tap"
tap "buildkite/buildkite"
tap "hashicorp/tap"
tap "manaflow-ai/cmux"
brew "aider"
brew "awscli"
brew "bat"
brew "container"
brew "crane"
brew "d2"
brew "direnv"
brew "envchain"
brew "fd"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "gnupg"
brew "go"
brew "helm"
brew "jq"
brew "k3d"
brew "kind"
brew "kubernetes-cli"
brew "okta-aws-cli"
brew "ollama"
brew "pinentry-mac"
brew "podman"
brew "poetry"
brew "pre-commit"
brew "ripgrep"
brew "rust"
brew "sesh"
brew "shellcheck"
brew "shfmt"
brew "stow"
brew "tailscale", restart_service: :changed
brew "tfenv"
brew "tmux"
brew "tree"
brew "uv"
brew "watch"
brew "ykman"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "anomalyco/tap/opencode"
brew "buildkite/buildkite/bk@3"
brew "hashicorp/tap/vault"
cask "alt-tab"
cask "claude-code@latest"
cask "cmux"
cask "font-jetbrains-mono-nerd-font"
cask "keybase"
