tap "anomalyco/tap"
tap "aws/tap"
tap "buildkite/buildkite"
tap "hashicorp/tap", trusted: true
tap "manaflow-ai/cmux"
tap "raine/claude-history"
# AI pair programming in your terminal
brew "aider"
# Get stuff done with container-native workflows for Kubernetes
brew "argo"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Create and run Linux containers using lightweight virtual machines
brew "container"
# Tool for interacting with remote images and registries
brew "crane"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Load/unload environment variables based on $PWD
brew "direnv"
# Secure your credentials in environment variables
brew "envchain"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Open-source, cross-platform JavaScript runtime environment
brew "node@22"
# Capability-based sandbox shell for AI agents with OS-enforced isolation
brew "nono"
# Okta federated identity for AWS CLI
brew "okta-aws-cli"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Development kit for the Java programming language
brew "openjdk"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Tool for managing OCI containers and pods
brew "podman"
# Alternative to docker-compose using podman
brew "podman-compose"
# Python package management tool
brew "poetry"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Smart session manager for the terminal
brew "sesh"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale", restart_service: :changed
# Terraform version manager inspired by rbenv
brew "tfenv"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Tool for managing your YubiKey configuration
brew "ykman"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode", trusted: true
# The official CLI for Amazon EKS
brew "aws/tap/eksctl", trusted: true
# Packer
brew "hashicorp/tap/packer"
# Vault
brew "hashicorp/tap/vault"
# Fuzzy-search Claude Code conversation history from the terminal
brew "raine/claude-history/claude-history", trusted: true
# Enable Windows-like alt-tab
cask "alt-tab"
# Terminal-based AI coding assistant
cask "claude-code@latest"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
cask "font-jetbrains-mono-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# End-to-end encryption software
cask "keybase"
go "github.com/elastic/tfutil-cli/cmd/tfutil"
cargo "cargo-about"
cargo "esdiag"
uv "-"
uv "-"
uv "-"
uv "rapid-mlx"
npm "@devcontainers/cli"
npm "@earendil-works/pi-coding-agent"
npm "@elastic/cli"
npm "@mariozechner/pi-coding-agent"
