brew "pre-commit"
brew "fzf"
brew "gh"
brew "gnupg"
if OS.mac?
	brew "pinentry-mac"
end
brew "ykman"
brew "jq"
brew "sesh"
brew "shellcheck"
brew "shfmt"
brew "kubectl"
brew "stow"
brew "tmux"
brew "tree"
brew "uv"
brew "zoxide"
brew "fd"
brew "bat"
brew "ripgrep"
brew "zsh-autosuggestions"
brew "tailscale"

cask "font-jetbrains-mono-nerd-font"
